let questions = [
  {
    question: "你早餐一般吃甚麼？",
    answers: [["水果/麥片"], ["麵包/牛奶"], ["包子/稀飯"], ["不吃早餐"]],
  },
  {
    question: "哪種性格的人最吸引你？",
    answers: [["神祕莫測"], ["外向友善"], ["熱情豪爽"], ["不喜歡人類"]],
  },
  {
    question: "你周末通常愛待在哪？",
    answers: [["朋友家"], ["商場裡"], ["自己家"], ["在哪待著都行"]],
  },
  {
    question: "你喜歡吃甚麼口味的冰淇淋？",
    answers: [
      ["巧克力"],
      ["水果"],
      ["堅果"],
      ["牛奶"],
      ["抹茶"],
      ["不愛吃冰淇淋"],
    ],
  },
  {
    question: "你一個月願意花多少錢在寵物身上？",
    answers: [["200以內"], ["200-500"], ["500-1000"], ["花多少錢都行"]],
  },
  {
    question: "以下選出你最喜歡的顏色組合？",
    answers: [
      ["紅/黃"],
      ["黑/白"],
      ["紫/粉"],
      ["金/銀"],
      ["藍/綠"],
      ["這裡沒有我喜歡的"],
    ],
  },
  {
    question: "你喜歡聽下列哪種類型的音樂？",
    answers: [["流行"], ["古典"], ["爵士"], ["我不聽歌"]],
  },
  {
    question: "除了貓以外，你還喜歡下面哪種動物？",
    answers: [["狗狗"], ["鳥"], ["蜥蜴"], ["永遠只愛貓"]],
  },
];

let finalAnswers = {
  A: ["灰灰貓", "all_gray"],
  B: ["小橘子", "orange"],
  C: ["飯糰貓", "gray"],
  D: ["花花貓", "folwer"],
};
