let questions = [
  {
    question: "你早餐一般吃甚麼？",
    answers: [
      ["水果/麥片", 0],
      ["麵包/牛奶", 1],
      ["包子/稀飯", 2],
      ["不吃早餐", 3],
    ],
  },
  {
    question: "哪種性格的人最吸引你？",
    answers: [
      ["神祕莫測", 3],
      ["外向友善", 0],
      ["熱情豪爽", 2],
      ["不喜歡人類", 1],
    ],
  },
  {
    question: "你周末通常愛待在哪？",
    answers: [
      ["朋友家", 0],
      ["商場裡", 0],
      ["自己家", 1],
      ["在哪待著都行", 1],
    ],
  },
  {
    question: "你喜歡吃甚麼口味的冰淇淋？",
    answers: [
      ["巧克力", 1],
      ["水果", 2],
      ["堅果", 0],
      ["牛奶", 0],
      ["抹茶", 3],
      ["不愛吃冰淇淋", 1],
    ],
  },
  {
    question: "你一個月願意花多少錢在寵物身上？",
    answers: [
      ["200以內", 1],
      ["200-500", 1],
      ["500-1000", 0],
      ["花多少錢都行", 3],
    ],
  },
  {
    question: "以下選出你最喜歡的顏色組合？",
    answers: [
      ["紅/黃", 1],
      ["黑/白", 0],
      ["紫/粉", 2],
      ["金/銀", 3],
      ["藍/綠", 1],
      ["這裡沒有我喜歡的", 0],
    ],
  },
  {
    question: "你喜歡聽下列哪種類型的音樂？",
    answers: [
      ["流行", 0],
      ["古典", 1],
      ["爵士", 2],
      ["我不聽歌", 3],
    ],
  },
  {
    question: "除了貓以外，你還喜歡下面哪種動物？",
    answers: [
      ["狗狗", 3],
      ["鳥", 3],
      ["蜥蜴", 3],
      ["永遠只愛貓", 3],
    ],
  },
];

let finalAnswers = [
  { cn: "灰灰貓", en: "all_gray", score: 0 },
  { cn: "小橘子", en: "orange", score: 0 },
  { cn: "飯糰貓", en: "gray", score: 0 },
  { cn: "花花貓", en: "folwer", score: 0 },
];
